вар2

1. Программа для подсчета совпадающих чисел
Задача: Есть два списка чисел, нужно найти, сколько чисел содержится одновременно в обоих списках.
print(len(set([1, 3, 2]) & set([4, 3, 2])))
